<?php
	
//马虎者的创建方式

$my = array('name' => "我 ",'age' =>  "20","174",'安徽');

 print_r($my);
 
 /*
  *分析出：
  * 如果指定的键，则以指定的准。
  * 如果没有指定，则从0开始，逐一递增。 （不够准确的）
  */
  
  $class[] = "张三";
  $class[] = "李四";
  $class[5] = "王五";
  $class[] = "赵六";
  $class[] = "郑七";
  
  print_r($class);
  
  /*
   * 如果给出方括号但没有指定键名，则取当前最大整数索引值，新的键名将是该值 +1。
   * 如果当前还没有整数索引，则键名将为0。
   * 如果指定的键名已经有值了，该值将被覆盖。
   */
 
 
  $butty[] = "林志玲";
  $butty[] = "苍进空";
  $butty[1] = "武藤兰";
  $butty[3] = "小泽玛利亚";
  
  print_r($butty);
  
  //上面这3个例子，讨论清楚键的增长关系。
  
 
 
 
 
 
 
 
 
 